'''
Завдяння 1.4.2 варіант 4
'''
import timeit#імпортуємо для того щоб дізнатись час роботи програми
name = []#створюємо пусті списки для заповнення з заявок
weigth = []
container = []
store = []
number = []
num = []
x = ['банани' , 'ананаси' , 'огірки' , 'ківі' , 'помідори']#товар на складі
g = {a: b for (a,b) in zip(x,['ТАК', 'ТАК', 'НІ' 'НІ', 'ТАК'])}#словник з відповідною інформацією щодо тари
v = {a: b for (a,b) in zip(x,[42, 53, 0, 0, 54])}#кількість дрібної тари  на складі
while True:
    while True:
        try:
            print('Введіть заявку на товар')#користувач вводить дані
            nm,n,w,c,s = int(input('Номер заявки: ')),input('Назва: '),int(input('Вага: ')),input('Тара(чи потрібна дрібна розфасовка; ТАК або НІ): '),int(input('Номер магазину: '))
            if c == 'ТАК':#додаткова перевірка щоб зайвий раз користувач не вводив нуль
                n1 = int(input('Кількість дрібної тари: '))
            else:
                n1 = 0
            break
        except TypeError or ValueError or KeyError:#перехоплюємо помилки
            print('Помилка! Введіть ще раз')
    name.append(n)#заповнюємо списки відповідною інформацією
    weigth.append(w)
    container.append(c)
    store.append(s)
    number.append(n1)
    num.append(nm)
    print('Додати ще одну заявку? Напишіть так чи ні')
    l = input('')#а це щоб додати ще заявку
    if l=='так':
        continue
    else:
        break
y = {a: b for (a,b) in zip(num,name)}
m = {a: b for (a,b) in zip(num,weigth)}
p = {a: b for (a,b) in zip(num,store)}
d = {a: b for (a,b) in zip(num,container)}
z = {a: b for (a,b) in zip(num,number)}
for i in num:
    if y[i] in x:
        if d[i]=='НІ':
            print(f'Заявка №{i} прийнята: товар {y[i]}; вага {m[i]}; до магазину №{p[i]}; дрібна розфасовка не потрібна ')
        elif d[i]=='ТАК':
            for j in x:#перебираємо список товарів на складі
                if y[i] == j:#порівнюємо з заданим користувачем товаром
                    if g[j]=='ТАК':#перевіряємо чи є дрібна тара такого товару на складі
                        if z[i] <= v[j]:#первевіряєм чи є достатня кількість товару дрібної тари на складі
                            print(f'Заявка №{i} прийнатя: товар {y[i]}; вага {m[i]}; до магазину №{p[i]}; необхідна дрібна розфасовка')
                        else:
                            print(f'За заявкою №{i} немає достатньої кількості даного товару дрібної тари')
                    else:
                        print(f'За заявкою №{i} немає товару дрібної розфасовки')
    else:
        print(f'Товару за заявкою №{i} немає на складі')
t = timeit.timeit('"-".join(str(n) for n in range(100))', number=10000)
print('Час роботи програми: {:.3f}'.format(t))