'''
Завдання 1.3.2 завдання 2
'''
import timeit #імпортуємо для того щоб дізнатись час роботи програми
import numpy as np #імпортуємо для роботи з масивами
from random import randint #для рандомного вибору чисел
while True:#зациклили програму
    while True:
        try:#перевірка
            n = input('Хочете самостійно ввести послідовність чисел? Напишіть так чи ні ') #користувач вибирає рандом чи ведення власноруч
            a = np.zeros(10, dtype=int) #сторюємо масив з нулями розмірність 10
            w = int(input('Введіть число яке має шукати програма: '))#користувач вводить число яке буде шукати програма
            if n == 'так':
                for i in range(10):#користувач власноруч вводить кожен елемент
                    a[i] = int(input(f'Enter {i + 1} element: '))
            else:
                for i in range(10):#рандомне введення елементів
                    a[i] = randint(-10, 10)
            break
        except ValueError or NameError or TypeError:
            print('Введіть ще раз')
    print(sorted(a))#виводимо відсортовану матрицю
    x = 0#вводимо додаткові зміні для нашого алгоритму; лічильник
    r = len(a) - 1
    k = 0
    count = 0
    flag = False
    while x <= r and not flag:#використовуємо лічильник
        count += 2  #кількість перевірок
        k = (x + r) // 2 #ділимо масив навпіл
        if a[k] == w: #перевіряємо в одній із частин
            flag = True#в якій частині будемо шукати залежить від того чи заданий елемент більше за той з яким його порівнюєм чи менше
        elif a[k] < w:
            count += 1
            x = k + 1
        else:
            count += 1
            r = k - 1
    if not flag:
        print('Елемент не знайдено')
    else:
        print(f'Елемент {w} знаходиться а позиції {k + 1}')#знаходимо на якій позиції потрібний нам елемент
    print(f'Порівняння виконано {count} раз/разів')#виводимо остаточну кількість перевірок

    print('Запустити програму ще раз? Напишіть так чи ні')
    l = input('')  # цикл умові якщо хоче ористувач ще раз запустити програму
    if l == 'так':
        continue  # програма починається заново
    else:
        break  # цикл обривається

t = timeit.timeit('"-".join(str(n) for n in range(100))', number=10000)
print('Час роботи програми: {:.3f}'.format(t))  # показує час виконання програми