'''
Завдання 1.3.2 завдання 3
'''
import timeit #імпортуємо для того щоб дізнатись час роботи програми
import numpy as np #імпортуємо для роботи з масивами
from random import randint #для рандомного вибору чисел
while True:#зациклили програму
    while True:
        try:#перевірка
            x = input(
                'Хочете самостійно ввести послідовність чисел? Напишіть так чи ні ')  # користувач вибирає рандом чи ведення власноруч
            a = np.zeros(10, dtype=int)  # сторюємо масив з нулями розмірність 10
            d = int(
                input('Введіть число яке має шукати програма: '))  # користувач вводить число яке буде шукати програма
            if x == 'так':
                for i in range(10):  # користувач власноруч вводить кожен елемент
                    a[i] = int(input(f'Enter {i + 1} element: '))
            else:
                for i in range(10):  # рандомне введення елементів
                    a[i] = randint(-10, 10)
            break
        except ValueError or NameError or TypeError:
            print('Введіть ще раз')
    print(a)
    len_a = len(a)
    i = 0
    count = 0  #кількість перевірок
    while i < len_a and a[i] != d: #перевіряємо елемент на співпадіння починаючи з першого
        i += 1 #зсуваєм кожен елемент
        count += 2 #і одночасно збільшуємо кількість перевірок
    if i == len_a:
        print('Елемент не знайдено')
    else:#знаходимо на якій позиції потрібний нам елемент
        print(f'Елемент {d} знаходиться а позиції {i + 1} ')
    print(f'Порівняння виконано {count} раз/разів')#виводимо остаточну кількість перевірок

    print('Запустити програму ще раз? Напишіть так чи ні')
    l = input('')  # цикл умові якщо хоче ористувач ще раз запустити програму
    if l == 'так':
        continue  # програма починається заново
    else:
        break  # цикл обривається

t = timeit.timeit('"-".join(str(n) for n in range(100))', number=10000)
print('Час роботи програми: {:.3f}'.format(t))  # показує час виконання програми